{
    "Useful links": "Przydatne linki",
    "Privacy Policy": "Polityka Prywatności",
    "Cookie Policy": "Polityka Plików Cookies",
    "Love what I do?": "Podoba ci się to co robię?",
    "Consider buying me a": "Rozważ kupienie mi ",
    "coffee": "kawy",
    "Most link shorteners do too much.": "Większość skracaczy linków robi zbyt wiele.",
    "This one just makes your links shorter.": "Ten po prostu sprawia, że Twoje linki są krótsze.",
    "Type link here": "Wpisz link tutaj",
    "Show QR code": "Pokaż kod QR",
    "How does it work?": "Jak to działa?",
    "For a link to be shortened, you must provide it in the correct form. The site accepts links like: https://example.com, http://example.com or ftp://example.com.": "Aby link został skrócony, musisz podać go w odpowiedniej formie. Strona akceptuje linki typu: https://example.com, http://example.com lub ftp://example.com.",
    "When you click the Cut.It button, your link is saved in the database, and shortened. The shortened link will be deleted from our database if it is not used at least once during 30 days. The counter resets after each use of the link.": "W momencie, gdy klikniesz przycisk CutIt, twój link zostaje zapisany do bazy danych, oraz skrócony. Skrócony link zostanie usunięty z naszej bazy danych, gdy nie zostanie użyty choć raz przez 30 dni. Licznik resetuje się po każdym użyciu linku.",
    "Thanks to this solution our database will not be clogged with unused links.": "Dzięki takiemu rozwiązaniu nasza baza danych nie będzie zapychana nieużywanymi linkami.",
    "Your privacy is important to us. It is Cut.It's policy to respect your privacy and comply with all applicable laws and regulations regarding any personal information we may collect about you, including on this site and other sites we own and operate.": "Twoja prywatność jest dla nas ważna. Polityką Cut.It jest poszanowanie prywatności użytkownika i przestrzeganie wszystkich obowiązujących przepisów prawa i regulacji dotyczących danych osobowych, które możemy gromadzić na jego temat, w tym na tej stronie oraz na innych stronach, których jesteśmy właścicielem i operatorem.",
    "This policy is effective as of 23 December 2021 and was last updated on 19 March 2022.": "Niniejsze zasady obowiązują od dnia 23 grudnia 2021 r. i zostały ostatnio zaktualizowane w dniu 19 marca 2022 r.",
    "Information We Collect": "Informacje, które zbieramy",
    "For the operation of the site, we only store:": "W celu obsługi witryny przechowujemy jedynie",
    "the original link you want to shorten": "oryginalny link, który chcesz skrócić",
    "the shortened link": "skrócony link",
    "the date the shortened link was first created": "data pierwszego utworzenia skróconego linku",
    "the date the link was \"updated\"": "data kiedy link został \"zaktualizowany\"",
    "the date the link was last used": "data ostatniego użycia linku",
    "This information by itself does not identify an individual, nor does the combination of this information with other data identify individual persons.": "Informacje te same w sobie nie pozwalają na identyfikację osoby fizycznej, a połączenie ich z innymi danymi nie pozwala na identyfikację poszczególnych osób.",
    "A link is \"updated\" when a user wants to shorten a link that already exists in our database, which resets the countdown to removing it from the database.": "Link jest \"aktualizowany\", gdy użytkownik chce skrócić link, który już istnieje w naszej bazie danych, co powoduje zresetowanie odliczania do usunięcia go z bazy danych.",
    "How long do we keep the information you give us": "Jak długo przechowujemy podane przez Ciebie informacje",
    "We keep the data you provide to us for as long as it is used by you on our service.": "Przekazane nam dane przechowujemy tak długo, jak długo są one wykorzystywane przez użytkownika w naszym serwisie.",
    "Data is deleted 30 days after the last use of your shortened link.": "Dane są usuwane po upływie 30 dni od ostatniego użycia skróconego linku.",
    "Disclosure of Information to Third Parties": "Ujawnianie informacji stronom trzecim",
    "We may disclose information to:": "Możemy ujawniać informacje do:",
    "third party service providers for the purpose of enabling them to provide their services, for example, IT service providers, data storage, hosting and server providers": "zewnętrznych dostawców usług w celu umożliwienia im świadczenia usług, na przykład dostawcy usług informatycznych, przechowywania danych, hostingu i serwerów",
    "our employees, contractors, and/or related entities": "naszych pracowników, wykonawców i/lub podmiotów powiązanych",
    "courts, tribunals, regulatory authorities, and law enforcement officers, as required by law, in connection with any actual or prospective legal proceedings, or in order to establish, exercise, or defend our legal rights": "sądów, trybunałów, organów regulacyjnych oraz funkcjonariuszy organów ścigania, zgodnie z wymogami prawa, w związku z jakimkolwiek obecnym lub przyszłym postępowaniem prawnym lub w celu ustanowienia, wykonania lub obrony naszych praw",
    "Your Rights and Controlling Your Personal Information": "Prawa użytkownika i kontrola nad danymi osobowymi",
    "As we do not store any information by which you can be identified, it is not possible for us to remove a shortened link at your request, as it cannot be confirmed that it was created by you.": "Ponieważ nie przechowujemy żadnych informacji umożliwiających identyfikację użytkownika, nie mamy możliwości usunięcia skróconego linku na jego prośbę, gdyż nie można potwierdzić, że zostało ono utworzone przez niego.",
    "An exception is when a reported link leads to illegal content prohibited by law. You can report any such links using the contact information at the bottom of the page.": "Wyjątkiem jest sytuacja, gdy zgłoszony link prowadzi do treści nielegalnych, zabronionych przez prawo. Takie linki można zgłaszać, korzystając z informacji kontaktowych podanych na dole strony.",
    "If you believe that we have breached a relevant data protection law and wish to make a complaint, please contact us using the details below and provide us with full details of the alleged breach. We will promptly investigate your complaint and respond to you, setting out the outcome of our investigation and the steps we will take to deal with your complaint. You also have the right to contact a regulatory body or data protection authority in relation to your complaint.": "Jeśli uważasz, że naruszyliśmy odpowiednie przepisy dotyczące ochrony danych i chcesz złożyć skargę, skontaktuj się z nami, korzystając z poniższych danych i podając nam pełne informacje na temat domniemanego naruszenia. Niezwłocznie zbadamy Twoją skargę i odpowiemy Ci, przedstawiając wynik naszego dochodzenia oraz kroki, jakie podejmiemy w celu rozpatrzenia Twojej skargi. Użytkownik ma również prawo skontaktować się z organem regulacyjnym lub organem ochrony danych w związku ze swoją skargą.",
    "Limits of Our Policy": "Granice naszej polityki",
    "Contact Us": "Skontaktuj się z nami",
    "For any questions or concerns regarding your privacy, you may contact us using the following details:": "W przypadku jakichkolwiek pytań lub wątpliwości dotyczących prywatności, można skontaktować się z nami, korzystając z następujących danych:",
    "Use of Cookies": "Stosowanie plików cookie",
    "We use \"cookies\" to collect information about you (for example, to determine what language to display the site in). A cookie is a small piece of data that our site stores on your computer and accesses each time you visit so that we can understand how you use our site. This helps us to provide you with the best possible content.": "Używamy plików \"cookie\" do zbierania informacji o Tobie (na przykład, aby określić, w jakim języku wyświetlać stronę). Plik cookie to niewielki fragment danych, który nasza witryna przechowuje na komputerze użytkownika i uzyskuje do niego dostęp przy każdej wizycie, dzięki czemu możemy zrozumieć, w jaki sposób użytkownik korzysta z naszej witryny. Pomaga nam to w dostarczaniu Ci najlepszych możliwych treści.",
    "Our website may link to external sites that are not operated by us. Please be aware that we have no control over the content and policies of those sites, and cannot accept responsibility or liability for their respective privacy practices.": "Nasza strona może zawierać linki do zewnętrznych stron, które nie są przez nas obsługiwane. Należy pamiętać, że nie mamy żadnej kontroli nad treścią i polityką tych stron i nie możemy przyjąć odpowiedzialności za ich odpowiednie praktyki dotyczące prywatności.",
    "Changes to This Policy": "Zmiany w niniejszej Polityce",
    "At our discretion, we may change our privacy policy to reflect updates to our business processes, current acceptable practices, or legislative or regulatory changes. If we decide to change this privacy policy, we will post the changes here at the same link by which you are accessing this privacy policy.": "Według własnego uznania możemy zmienić naszą politykę prywatności, aby odzwierciedlić aktualizacje naszych procesów biznesowych, bieżące dopuszczalne praktyki lub zmiany legislacyjne i regulacyjne. Jeśli zdecydujemy się na zmianę niniejszej polityki prywatności, zamieścimy zmiany tutaj, pod tym samym linkiem, za pomocą którego uzyskują Państwo dostęp do niniejszej polityki prywatności.",
    "If required by law, we will get your permission or give you the opportunity to opt in to or opt out of, as applicable, any new uses of your personal information.": "Jeśli jest to wymagane przez prawo, uzyskamy Państwa zgodę lub umożliwimy Państwu wyrażenie zgody lub rezygnację, w zależności od przypadku, z wszelkich nowych sposobów wykorzystania Państwa danych osobowych.",
    "Oh no!": "O nie!",
    "This page has been abducted!": "Ta strona została porwana!",
    "Let's head back home and try that again.": "Wracajmy do domu i spróbujmy jeszcze raz.",
    "The truth is out there...": "Prawda jest gdzieś tam..."
}
