{
    "Useful links": "Przydatne linki",
    "Privacy Policy": "Polityka Prywatności",
    "Cookie Policy": "Polityka Plików Cookies",
    "Love what I do?": "Podoba ci się to co robię?",
    "Please, consider buying me a": "Proszę, rozważ kupienie mi ",
    "coffee": "kawy",
    "Most link shorteners do too much.": "Większość skracaczy linków robi zbyt wiele.",
    "This one just makes your links shorter.": "Ten po prostu sprawia, że Twoje linki są krótsze.",
    "Type your link here": "Wpisz link tutaj",
    "Show QR code": "Pokaż kod QR",
    "How does it work?": "Jak to działa?",
    "For a link to be shortened, you must provide it in the correct form. The site accepts links like: https://example.com, http://example.com or ftp://example.com.": "Aby link został skrócony, musisz podać go w odpowiedniej formie. Strona akceptuje linki typu: https://example.com, http://example.com lub ftp://example.com.",
    "When you click the Cut.It button, your link is saved in the database, and shortened. The shortened link will be deleted from our database if it is not used at least once during 30 days. The counter resets after each use of the link.": "W momencie, gdy klikniesz przycisk CutIt, twój link zostaje zapisany do bazy danych, oraz skrócony. Skrócony link zostanie usunięty z naszej bazy danych, gdy nie zostanie użyty choć raz przez 30 dni. Licznik resetuje się po każdym użyciu linku.",
    "Thanks to this solution our database will not be clogged with unused links.": "Dzięki takiemu rozwiązaniu nasza baza danych nie będzie zapychana nieużywanymi linkami.",
    "Your privacy is important to us. It is Cut.It's policy to respect your privacy and comply with any applicable law and regulation regarding any personal information we may collect about you, including across our website, https://cutit.com, and other sites we own and operate.": "Twoja prywatność jest dla nas ważna. Polityką Cut.It jest poszanowanie Państwa prywatności i przestrzeganie obowiązującego prawa i przepisów dotyczących wszelkich danych osobowych, które możemy gromadzić na Państwa temat, w tym na naszej stronie internetowej, https://cutit.com oraz innych stronach, które posiadamy i obsługujemy.",
    "This policy is effective as of 23 December 2021 and was last updated on 23 December 2021.": "Niniejsze zasady obowiązują od dnia 23 grudnia 2021 r. i zostały ostatnio zaktualizowane w dniu 23 grudnia 2021 r.",
    "Information We Collect": "Informacje, które zbieramy",
    "Information we collect includes both information you knowingly and actively provide us when using or participating in any of our services and promotions, and any information automatically sent by your devices in the course of accessing our products and services.": "Gromadzone przez nas informacje obejmują zarówno informacje, które użytkownik świadomie i aktywnie przekazuje nam podczas korzystania z naszych usług i promocji lub podczas uczestniczenia w nich, jak i wszelkie informacje automatycznie przesyłane przez urządzenia użytkownika w trakcie uzyskiwania dostępu do naszych produktów i usług.",
    "Log Data": "Dane dziennika",
    "When you visit our website, our servers may automatically log the standard data provided by your web browser. It may include your device's Internet Protocol (IP) address, your browser type and version, the pages you visit, the time and date of your visit, the time spent on each page, other details about your visit, and technical details that occur in conjunction with any errors you may encounter.": "Kiedy odwiedzasz naszą stronę internetową, nasze serwery mogą automatycznie rejestrować standardowe dane dostarczane przez Twoją przeglądarkę internetową. Mogą one obejmować adres IP urządzenia, typ i wersję przeglądarki, odwiedzane strony, godzinę i datę wizyty, czas spędzony na każdej stronie, inne szczegóły dotyczące wizyty oraz szczegóły techniczne, które występują w połączeniu z wszelkimi błędami, jakie mogą Państwo napotkać.",
    "Please be aware that while this information may not be personally identifying by itself, it may be possible to combine it with other data to personally identify individual persons.": "Należy pamiętać, że chociaż informacje te same w sobie nie mogą być identyfikujące, może być możliwe połączenie ich z innymi danymi w celu identyfikacji poszczególnych osób.",
    "Collection and Use of Information": "Gromadzenie i wykorzystywanie informacji",
    "We may collect personal information from you when you do any of the following on our website:": "Możemy zbierać dane osobowe od Ciebie, gdy wykonujesz którąkolwiek z poniższych czynności na naszej stronie internetowej:",
    "Contact us via email, social media, or on any similar technologies": "Skontaktujesz się z nami za pośrednictwem poczty elektronicznej, mediów społecznościowych lub innych podobnych technologii",
    "When you mention us on social media": "Kiedy wspomnisz o nas w mediach społecznościowych",
    "We may collect, hold, use, and disclose information for the following purposes, and personal information will not be further processed in a manner that is incompatible with these purposes:": "Możemy gromadzić, przechowywać, wykorzystywać i ujawniać informacje w następujących celach, a dane osobowe nie będą dalej przetwarzane w sposób niezgodny z tymi celami:",
    "Please be aware that we may combine information we collect about you with general information or research data we receive from other trusted sources.": "Należy pamiętać, że możemy łączyć informacje, które zbieramy o użytkowniku z ogólnymi informacjami lub danymi badawczymi, które otrzymujemy z innych zaufanych źródeł.",
    "Security of Your Personal Information": "Bezpieczeństwo Twoich danych osobowych",
    "When we collect and process personal information, and while we retain this information, we will protect it within commercially acceptable means to prevent loss and theft, as well as unauthorized access, disclosure, copying, use, or modification.": "Podczas gromadzenia i przetwarzania danych osobowych, a także podczas przechowywania tych informacji, będziemy je chronić w ramach komercyjnie dopuszczalnych środków w celu zapobieżenia utracie i kradzieży, a także nieupoważnionego dostępu, ujawnienia, kopiowania, wykorzystania lub modyfikacji.",
    "Although we will do our best to protect the personal information you provide to us, we advise that no method of electronic transmission or storage is 100% secure, and no one can guarantee absolute data security. We will comply with laws applicable to us in respect of any data breach.": "Mimo, że dołożymy wszelkich starań, aby chronić dane osobowe, które nam Państwo przekazują, informujemy, że żadna metoda transmisji elektronicznej lub przechowywania nie jest w 100% bezpieczna i nikt nie może zagwarantować całkowitego bezpieczeństwa danych. W przypadku jakiegokolwiek naruszenia danych będziemy postępować zgodnie z obowiązującymi nas przepisami prawa.",
    "You are responsible for selecting any password and its overall security strength, ensuring the security of your own information within the bounds of our services.": "Użytkownik jest odpowiedzialny za wybór hasła i jego ogólną siłę bezpieczeństwa, zapewniając bezpieczeństwo własnych informacji w granicach naszych usług.",
    "How Long We Keep Your Personal Information": "Jak długo przechowujemy Twoje dane osobowe",
    "We keep your personal information only for as long as we need to. This time period may depend on what we are using your information for, in accordance with this privacy policy. If your personal information is no longer required, we will delete it or make it anonymous by removing all details that identify you.": "Przechowujemy Państwa dane osobowe tylko tak długo, jak jest to konieczne. Okres ten może zależeć od tego, do czego wykorzystujemy dane osobowe, zgodnie z niniejszą polityką prywatności. Jeśli Twoje dane osobowe nie są już potrzebne, usuniemy je lub uczynimy je anonimowymi poprzez usunięcie wszystkich szczegółów, które Cię identyfikują.",
    "However, if necessary, we may retain your personal information for our compliance with a legal, accounting, or reporting obligation or for archiving purposes in the public interest, scientific, or historical research purposes or statistical purposes.": "Jednakże, jeśli jest to konieczne, możemy zachować dane osobowe użytkownika w celu zapewnienia zgodności z obowiązkiem prawnym, rachunkowym lub sprawozdawczym lub do celów archiwizacji w interesie publicznym, do celów badań naukowych lub historycznych lub do celów statystycznych.",
    "Children's Privacy": "Prywatność dzieci",
    "We do not aim any of our products or services directly at children under the age of 13, and we do not knowingly collect personal information about children under 13.": "Nie kierujemy żadnego z naszych produktów ani usług bezpośrednio do dzieci poniżej 13 roku życia i świadomie nie gromadzimy danych osobowych dzieci poniżej 13 roku życia.",
    "Disclosure of Personal Information to Third Parties": "Ujawnianie danych osobowych stronom trzecim",
    "We may disclose personal information to:": "Możemy ujawnić dane osobowe:",
    "a parent, subsidiary, or affiliate of our company": "podmiotom dominującym, zależnym lub stowarzyszonym z naszą firmą",
    "third party service providers for the purpose of enabling them to provide their services, for example, IT service providers, data storage, hosting and server providers, advertisers, or analytics platforms": "usługodawcom zewnętrznym w celu umożliwienia im świadczenia usług, na przykład dostawcom usług IT, dostawcom usług przechowywania danych, hostingu i serwerów, reklamodawcom lub platformom analitycznym",
    "our employees, contractors, and/or related entities": "naszym pracownikom, wykonawcom i/lub podmiotom powiązanym",
    "our existing or potential agents or business partners": "naszym obecnym lub potencjalnym przedstawicielom lub partnerom biznesowym",
    "courts, tribunals, regulatory authorities, and law enforcement officers, as required by law, in connection with any actual or prospective legal proceedings, or in order to establish, exercise, or defend our legal rights": "sądom, trybunałom, organom regulacyjnym oraz funkcjonariuszom organów ścigania, zgodnie z wymogami prawa, w związku z wszelkimi aktualnymi lub przyszłymi postępowaniami prawnymi lub w celu ustanowienia, wykonania lub obrony naszych praw",
    "third parties, including agents or sub-contractors, who assist us in providing information, products, services, or direct marketing to you third parties to collect and process data": "stronom trzecim, w tym agentom lub podwykonawcom, którzy pomagają nam w dostarczaniu informacji, produktów, usług lub marketingu bezpośredniego do użytkownika stron trzecich w celu gromadzenia i przetwarzania danych",
    "International Transfers of Personal Information": "Międzynarodowe przekazywanie danych osobowych",
    "The personal information we collect is stored and/or processed where we or our partners, affiliates, and third-party providers maintain facilities. Please be aware that the locations to which we store, process, or transfer your personal information may not have the same data protection laws as the country in which you initially provided the information. If we transfer your personal information to third parties in other countries: (i) we will perform those transfers in accordance with the requirements of applicable law; and (ii) we will protect the transferred personal information in accordance with this privacy policy.": "Gromadzone przez nas dane osobowe są przechowywane i/lub przetwarzane w obiektach należących do nas lub naszych partnerów, podmiotów stowarzyszonych i dostawców zewnętrznych. Należy pamiętać, że w miejscach, w których przechowujemy, przetwarzamy lub przekazujemy dane osobowe, mogą obowiązywać inne przepisy dotyczące ochrony danych niż w kraju, w którym użytkownik pierwotnie przekazał te informacje. Jeśli przekażemy Państwa dane osobowe stronom trzecim w innych krajach: (i) będziemy dokonywać tych transferów zgodnie z wymogami obowiązującego prawa; oraz (ii) będziemy chronić przekazane dane osobowe zgodnie z niniejszą polityką prywatności.",
    "Your Rights and Controlling Your Personal Information": "Prawa użytkownika i kontrola nad danymi osobowymi",
    "You always retain the right to withhold personal information from us, with the understanding that your experience of our website may be affected. We will not discriminate against you for exercising any of your rights over your personal information. If you do provide us with personal information you understand that we will collect, hold, use and disclose it in accordance with this privacy policy. You retain the right to request details of any personal information we hold about you.": "Użytkownik zawsze zachowuje prawo do nieujawniania nam swoich danych osobowych, z zastrzeżeniem, że może to mieć wpływ na korzystanie z naszej strony internetowej. Nie będziemy dyskryminować użytkownika w związku z korzystaniem przez niego z któregokolwiek z praw dotyczących jego danych osobowych. Jeśli przekażesz nam swoje dane osobowe, rozumiesz, że będziemy je zbierać, przechowywać, wykorzystywać i ujawniać zgodnie z niniejszą polityką prywatności. Użytkownik zachowuje prawo do zażądania szczegółowych informacji na temat danych osobowych, które przechowujemy na jego temat.",
    "If we receive personal information about you from a third party, we will protect it as set out in this privacy policy. If you are a third party providing personal information about somebody else, you represent and warrant that you have such person's consent to provide the personal information to us.": "Jeśli otrzymamy dane osobowe od osoby trzeciej, będziemy je chronić zgodnie z niniejszą polityką prywatności. Jeśli jesteś stroną trzecią dostarczającą dane osobowe o kimś innym, oświadczasz i gwarantujesz, że posiadasz zgodę tej osoby na dostarczenie nam tych danych osobowych.",
    "If you have previously agreed to us using your personal information for direct marketing purposes, you may change your mind at any time. We will provide you with the ability to unsubscribe from our email-database or opt out of communications. Please be aware we may need to request specific information from you to help us confirm your identity.": "Jeśli wcześniej użytkownik wyraził zgodę na wykorzystywanie przez nas swoich danych osobowych do celów marketingu bezpośredniego, może w każdej chwili zmienić zdanie. Zapewnimy Ci możliwość wypisania się z naszej bazy danych e-mail lub zrezygnowania z komunikacji. Należy pamiętać, że możemy poprosić o konkretne informacje, które pomogą nam potwierdzić tożsamość użytkownika.",
    "If you believe that any information we hold about you is inaccurate, out of date, incomplete, irrelevant, or misleading, please contact us using the details provided in this privacy policy. We will take reasonable steps to correct any information found to be inaccurate, incomplete, misleading, or out of date.": "Jeśli uważasz, że jakiekolwiek informacje, które posiadamy na Twój temat są niedokładne, nieaktualne, niekompletne, nieistotne lub wprowadzające w błąd, skontaktuj się z nami, korzystając z danych podanych w niniejszej polityce prywatności. Podejmiemy uzasadnione kroki w celu skorygowania wszelkich informacji, które okażą się niedokładne, niekompletne, wprowadzające w błąd lub nieaktualne.",
    "If you believe that we have breached a relevant data protection law and wish to make a complaint, please contact us using the details below and provide us with full details of the alleged breach. We will promptly investigate your complaint and respond to you, in writing, setting out the outcome of our investigation and the steps we will take to deal with your complaint. You also have the right to contact a regulatory body or data protection authority in relation to your complaint.": "Jeśli uważasz, że naruszyliśmy odpowiednie przepisy dotyczące ochrony danych i chcesz złożyć skargę, skontaktuj się z nami, korzystając z poniższych danych i podaj nam pełne informacje na temat domniemanego naruszenia. Niezwłocznie zbadamy Państwa skargę i odpowiemy Państwu na piśmie, przedstawiając wynik naszego dochodzenia oraz kroki, jakie podejmiemy w celu rozpatrzenia Państwa skargi. Mają Państwo również prawo do skontaktowania się z organem regulacyjnym lub organem ochrony danych w związku z Państwa skargą.",
    "Contact Us": "Skontaktuj się z nami",
    "For any questions or concerns regarding your privacy, you may contact us using the following details:": "W przypadku jakichkolwiek pytań lub wątpliwości dotyczących prywatności, można skontaktować się z nami, korzystając z następujących danych:",
    "Use of Cookies": "Stosowanie plików cookie",
    "We use \"cookies\" to collect information about you (for example, to determine what language to display the site in). A cookie is a small piece of data that our site stores on your computer and accesses each time you visit so that we can understand how you use our site. This helps us to provide you with the best possible content.": "Używamy plików \"cookie\" do zbierania informacji o Tobie (na przykład, aby określić, w jakim języku wyświetlać stronę). Plik cookie to niewielki fragment danych, który nasza witryna przechowuje na komputerze użytkownika i uzyskuje do niego dostęp przy każdej wizycie, dzięki czemu możemy zrozumieć, w jaki sposób użytkownik korzysta z naszej witryny. Pomaga nam to w dostarczaniu Ci najlepszych możliwych treści.",
    "Limits of Our Policy": "Ograniczenia naszej polityki",
    "Our website may link to external sites that are not operated by us. Please be aware that we have no control over the content and policies of those sites, and cannot accept responsibility or liability for their respective privacy practices.": "Nasza strona może zawierać linki do zewnętrznych stron, które nie są przez nas obsługiwane. Należy pamiętać, że nie mamy żadnej kontroli nad treścią i polityką tych stron i nie możemy przyjąć odpowiedzialności za ich odpowiednie praktyki dotyczące prywatności.",
    "Changes to This Policy": "Zmiany w niniejszej Polityce",
    "At our discretion, we may change our privacy policy to reflect updates to our business processes, current acceptable practices, or legislative or regulatory changes. If we decide to change this privacy policy, we will post the changes here at the same link by which you are accessing this privacy policy.": "Według własnego uznania możemy zmienić naszą politykę prywatności, aby odzwierciedlić aktualizacje naszych procesów biznesowych, bieżące dopuszczalne praktyki lub zmiany legislacyjne i regulacyjne. Jeśli zdecydujemy się na zmianę niniejszej polityki prywatności, zamieścimy zmiany tutaj, pod tym samym linkiem, za pomocą którego uzyskują Państwo dostęp do niniejszej polityki prywatności.",
    "If required by law, we will get your permission or give you the opportunity to opt in to or opt out of, as applicable, any new uses of your personal information.": "Jeśli jest to wymagane przez prawo, uzyskamy Państwa zgodę lub umożliwimy Państwu wyrażenie zgody lub rezygnację, w zależności od przypadku, z wszelkich nowych sposobów wykorzystania Państwa danych osobowych.",
    "Oh no!": "O nie!",
    "This page has been abducted!": "Ta strona została porwana!",
    "Let's head back home and try that again.": "Wracajmy do domu i spróbujmy jeszcze raz.",
    "The truth is out there...": "Prawda jest gdzieś tam..."
}
